#การใช้งานฟังก์ชัน print และ การเชื่อมต่อสตริง
print("Hello Python",'programming')
print(50)
print("Hello"+"Python")
print()
print(5*10/2)

#การใช้งานฟังก์ชัน input
first_name = input("กรุณาป้อนชื่อ")
last_name = input("กรุณาป้อนนามสกุล")
print("--------------------------")
print("คุณชื่อ:",first_name)
print("นามสกลุของคุณ :",last_name)

#การประกาศตัวแปรบนชื่อภาษาไทย
ปากกา  = "สีแดง" #ประกาศชื่อตัวแปร "ปากกา" เป็นชนิดข้อมูลสตริง
โทรศัพท์ = "Samsung" #ประกาศชื่อตัวแปร "โทรศัพท์"  เป็นชนิดข้อมูลสตริง
print("ปากกาสี =",ปากกา) #แสดงผลข้อมูลจากตัวแปร "ปากกา"
print("โทรศัพท์ ยี่ห้อ",โทรศัพท์) #แสดงผลข้อมูลจากตัวแปร "โทรศัพท์"
